app/controllers/allplans_controller.rb

INSERT INTO "allplans" ("dec_date", "created_at", "updated_at", "playeat") VALUES (?, ?, ?, ?)  [["dec_date", ""], ["created_at", "2021-09-01 06:55:57.389283"], ["updated_at", "2021-09-01 06:55:57.389283"], ["playeat", ""]]
---
  def create
    @allplans = Allplan.all
    @allplan = Allplan.new(allplan_params)
    if @allplan.save

SELECT  "allplans".* FROM "allplans" WHERE "allplans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @allplan = Allplan.find(params[:id])

SELECT  "allplans".* FROM "allplans" WHERE "allplans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def user
    @allplan = Allplan.find(params[:id])

SELECT  "allplans".* FROM "allplans" WHERE "allplans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("allplan_id", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["allplan_id", 1], ["username", "aaaaaaaaaaaaaaa"], ["created_at", "2021-09-01 06:56:08.124505"], ["updated_at", "2021-09-01 06:56:08.124505"]]
---
  def usercreate
    @allplan = Allplan.find(params[:id])
    @user = @allplan.users.new(user_params)
    @user.save

SELECT  "allplans".* FROM "allplans" WHERE "allplans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "allplans" SET "playeat" = ?, "updated_at" = ? WHERE "allplans"."id" = ?  [["playeat", "遊び"], ["updated_at", "2021-09-01 06:56:00.922903"], ["id", 1]]
INSERT INTO "days" ("allplan_id", "month", "day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["allplan_id", 1], ["month", 9], ["day", 2], ["created_at", "2021-09-01 06:56:01.124119"], ["updated_at", "2021-09-01 06:56:01.124119"]]
---
  def update
    @allplan = Allplan.find(params[:id])
    @allplan.update(allplan_params)
    # ////////////////////////////////////////
    require "date"
    d = Date.today
    month = d.month
    date = d.day
    num = 0

    p month
    p date
    if month === 2 or month === 4 or month === 6 or month === 9
       while num < 31 do
        if date === 30
          date = 0;
          month += 1
        end
         date += 1
        #  monthbox.push(month)
        #  daybox.push(date)
        @allplan.day.create(month:month,day:date)

SELECT  "allplans".* FROM "allplans" WHERE "allplans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @allplan = Allplan.find(params[:id])