app/controllers/decdates_controller.rb

SELECT  "allplans".* FROM "allplans" WHERE "allplans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "days".* FROM "days" WHERE "days"."id" = ? ORDER BY "days"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @allplan = Allplan.find(params[:id])
    @user = User.find(params[:id])
    @day = Day.where(id: @allplan.id).first